---
type: CurveElementFilter
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# CurveElementFilter

`Autodesk.Revit.DB.CurveElementFilter` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CurveElementFilter | — | `` |
| Method | PassesFilter | — | `` |
| Property | CurveElementType | 2011 | `public CurveElementType CurveElementType { get ; }` |